Autodesk.Revit.DB.ViewSheet.SetAdditionalRevisionIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the Revisions to additionally include in the sheet's revision schedules.
Remarks:
Additionally included Revisions will always participate in the sheet's revision schedules.
Normally a Revision is scheduled in the revision schedule because one of its associated RevisionClouds
is present on the sheet.
The additional project revision ids setting corresponds to the sheet's Revisions On Sheet parameter.
projectRevisionIds:
The ids of Revisions to explicitly include in the sheet's revision schedules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more ElementIds in projectRevisionIds do not correspond to a Revision element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewSheet.SetAdditionalProjectRevisionIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the Revisions to additionally include in the sheet's revision schedules.
projectRevisionIds:
The ids of Revisions to explicitly include in the sheet's revision schedules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more ElementIds in projectRevisionIds do not correspond to a Revision element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewSheet.GetAdditionalProjectRevisionIds
Gets the Revisions that are additionally included in the sheet's revision schedules.
Returns:
The additionally included Revisions for the sheet's revision schedules.
Since:
2014

Autodesk.Revit.DB.ViewSheet.GetAllProjectRevisionIds
Gets the ordered array of Revisions which participate in the sheet's revision schedules.
Returns:
The ordered array of ids of Revisions participating in the sheet's revision schedules.
Since:
2014

Autodesk.Revit.DB.ViewSheet.Views
Returns the set of all views on the sheet.